# номер последнего редактируемого кадра, название изображения (название видео + _ )
# (изображения имеют вид: название видео + _ + номер + .png)
# ДО МЕНЯ ТУТ ДОШЛО, ЧТО ДАЛЬШЕ ДЛЯ ПОЛУЧЕНИЯ САМИХ ДАТАСЕТОВ БУДКТ НУЖНЫ ТАКЖЕ ИСХОДНЫЕ ВЫСОТА И ШИРИНА
# Добавь их, если у тебя получение результата будет в этом же классе
# метод, который получает список точек Point и номер кадра, и сохраняет все точки в соответствующий файл


# переносить видео в корневую папку при желании пользователя
# возможность взять исходное количество кадров
# возможность возвращаться к разбиению видео (тогда нужно сохранять путь к видео и номер последнего кадра/прошедшее время,кол-во кадров в секунду)
# можно переводить в двоичный вид

# примечание: теперь изображения хранятся в папке frames внутри нашей папки сохранения
# путь в класс будет передаваться с учётом этого факта!!! добавлять не нужно

